In [1]:
import pandas as pd
import numpy as np

In [2]:
df_yield=pd.read_csv("yield.csv")

In [3]:
df_yield

,Domain Code,Domain,Area Code,Area,Element Code,Element,Item Code,Item,Year Code,Year,Unit,Value
0,QC,Crops,2,Afghanistan,5419,Yield,56,Maize,1961,1961,hg/ha,14000
1,QC,Crops,2,Afghanistan,5419,Yield,56,Maize,1962,1962,hg/ha,14000
2,QC,Crops,2,Afghanistan,5419,Yield,56,Maize,1963,1963,hg/ha,14260
3,QC,Crops,2,Afghanistan,5419,Yield,56,Maize,1964,1964,hg/ha,14257
4,QC,Crops,2,Afghanistan,5419,Yield,56,Maize,1965,1965,hg/ha,14400
...,...,...,...,...,...,...,...,...,...,...,...,...
56712,QC,Crops,181,Zimbabwe,5419,Yield,15,Wheat,2012,2012,hg/ha,24420
56713,QC,Crops,181,Zimbabwe,5419,Yield,15,Wheat,2013,2013,hg/ha,22888
56714,QC,Crops,181,Zimbabwe,5419,Yield,15,Wheat,2014,2014,hg/ha,21357
56715,QC,Crops,181,Zimbabwe,5419,Yield,15,Wheat,2015,2015,hg/ha,19826
56716,QC,Crops,181,Zimbabwe,5419,Yield,15,Wheat,2016,2016,hg/ha,18294

In [4]:
# drop unwanted columns
df_yield = df_yield.drop(['Year Code','Element Code','Element','Year Code','Area Code','Domain Code','Domain','Unit','Item Code'], axis=1)

In [5]:
# rename columns
df_yield = df_yield.rename(columns={"Value": "Yield (hg/ha)","Area":"Country"})
df_yield.head()

       Country   Item  Year  Yield (hg/ha)
0  Afghanistan  Maize  1961          14000
1  Afghanistan  Maize  1962          14000
2  Afghanistan  Maize  1963          14260
3  Afghanistan  Maize  1964          14257
4  Afghanistan  Maize  1965          14400

In [6]:
# number of unique countires
df_yield["Country"].nunique()

212

In [7]:
# list of unique countries
df_yield['Country'].unique()

array(['Afghanistan', 'Albania', 'Algeria', 'American Samoa', 'Angola',
       'Antigua and Barbuda', 'Argentina', 'Armenia', 'Australia',
       'Austria', 'Azerbaijan', 'Bahamas', 'Bahrain', 'Bangladesh',
       'Barbados', 'Belarus', 'Belgium', 'Belgium-Luxembourg', 'Belize',
       'Benin', 'Bermuda', 'Bhutan', 'Bolivia (Plurinational State of)',
       'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Brunei Darussalam', 'Bulgaria', 'Burkina Faso', 'Burundi',
       'Cabo Verde', 'Cambodia', 'Cameroon', 'Canada', 'Cayman Islands',
       'Central African Republic', 'Chad', 'Chile', 'China',
       'China, Hong Kong SAR', 'China, mainland',
       'China, Taiwan Province of', 'Colombia', 'Comoros', 'Congo',
       'Cook Islands', 'Costa Rica', "CÃ´te d'Ivoire", 'Croatia', 'Cuba',
       'Cyprus', 'Czechia', 'Czechoslovakia',
       "Democratic People's Republic of Korea",
       'Democratic Republic of the Congo', 'Denmark', 'Djibouti',
       'Dominica', 'Dominican Republic', 'Ecuador', 'Egypt',
       'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Estonia',
       'Ethiopia', 'Ethiopia PDR', 'Faroe Islands', 'Fiji', 'Finland',
       'France', 'French Guiana', 'French Polynesia', 'Gabon', 'Gambia',
       'Georgia', 'Germany', 'Ghana', 'Greece', 'Grenada', 'Guadeloupe',
       'Guam', 'Guatemala', 'Guinea', 'Guinea-Bissau', 'Guyana', 'Haiti',
       'Honduras', 'Hungary', 'Iceland', 'India', 'Indonesia',
       'Iran (Islamic Republic of)', 'Iraq', 'Ireland', 'Israel', 'Italy',
       'Jamaica', 'Japan', 'Jordan', 'Kazakhstan', 'Kenya', 'Kuwait',
       'Kyrgyzstan', "Lao People's Democratic Republic", 'Latvia',
       'Lebanon', 'Lesotho', 'Liberia', 'Libya', 'Lithuania',
       'Luxembourg', 'Madagascar', 'Malawi', 'Malaysia', 'Maldives',
       'Mali', 'Malta', 'Martinique', 'Mauritania', 'Mauritius', 'Mexico',
       'Micronesia (Federated States of)', 'Mongolia', 'Montenegro',
       'Montserrat', 'Morocco', 'Mozambique', 'Myanmar', 'Namibia',
       'Nepal', 'Netherlands', 'New Caledonia', 'New Zealand',
       'Nicaragua', 'Niger', 'Nigeria', 'Niue', 'Norway',
       'Occupied Palestinian Territory', 'Oman',
       'Pacific Islands Trust Territory', 'Pakistan', 'Panama',
       'Papua New Guinea', 'Paraguay', 'Peru', 'Philippines', 'Poland',
       'Portugal', 'Puerto Rico', 'Qatar', 'Republic of Korea',
       'Republic of Moldova', 'RÃ©union', 'Romania', 'Russian Federation',
       'Rwanda', 'Saint Kitts and Nevis', 'Saint Lucia',
       'Saint Vincent and the Grenadines', 'Samoa',
       'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Serbia and Montenegro', 'Seychelles', 'Sierra Leone', 'Singapore',
       'Slovakia', 'Slovenia', 'Solomon Islands', 'Somalia',
       'South Africa', 'South Sudan', 'Spain', 'Sri Lanka', 'Sudan',
       'Sudan (former)', 'Suriname', 'Eswatini', 'Sweden', 'Switzerland',
       'Syrian Arab Republic', 'Tajikistan', 'Thailand',
       'The former Yugoslav Republic of Macedonia', 'Timor-Leste', 'Togo',
       'Tonga', 'Trinidad and Tobago', 'Tunisia', 'Turkey',
       'Turkmenistan', 'Uganda', 'Ukraine', 'United Arab Emirates',
       'United Kingdom', 'United Republic of Tanzania',
       'United States of America', 'Uruguay', 'USSR', 'Uzbekistan',
       'Vanuatu', 'Venezuela (Bolivarian Republic of)', 'Viet Nam',
       'Wallis and Futuna Islands', 'Yemen', 'Yugoslav SFR', 'Zambia',
       'Zimbabwe'], dtype=object)

In [8]:
df_yield

           Country   Item  Year  Yield (hg/ha)
0      Afghanistan  Maize  1961          14000
1      Afghanistan  Maize  1962          14000
2      Afghanistan  Maize  1963          14260
3      Afghanistan  Maize  1964          14257
4      Afghanistan  Maize  1965          14400
...            ...    ...   ...            ...
56712     Zimbabwe  Wheat  2012          24420
56713     Zimbabwe  Wheat  2013          22888
56714     Zimbabwe  Wheat  2014          21357
56715     Zimbabwe  Wheat  2015          19826
56716     Zimbabwe  Wheat  2016          18294

[56717 rows x 4 columns]

In [9]:
# remove old country names and territories 
df_yield=df_yield.loc[(df_yield["Country"]!='American Samoa')&(df_yield["Country"]!='Belgium-Luxembourg')&\
                     (df_yield["Country"]!='Bermuda')&(df_yield["Country"]!='Cayman Islands')&\
                     (df_yield["Country"]!='China, Hong Kong SAR')&(df_yield["Country"]!='China, mainland')&\
                     (df_yield["Country"]!='China, Taiwan Province of')&(df_yield["Country"]!='Cook Islands')&\
                     (df_yield["Country"]!='Czechoslovakia')&(df_yield["Country"]!='Cook Islands')&\
                     (df_yield["Country"]!='Ethiopia PDR')&(df_yield["Country"]!='Faroe Islands')&\
                     (df_yield["Country"]!='French Guiana')&(df_yield["Country"]!='French Polynesia')&\
                     (df_yield["Country"]!='Guadeloupe')&(df_yield["Country"]!='Guam')&\
                     (df_yield["Country"]!='Martinique')&(df_yield["Country"]!='Montserrat')&\
                     (df_yield["Country"]!='New Caledonia')&(df_yield["Country"]!='Niue')&\
                     (df_yield["Country"]!='Pacific Islands Trust Territory')&(df_yield["Country"]!='Puerto Rico')&\
                     (df_yield["Country"]!='RÃ©union')&(df_yield["Country"]!='Serbia and Montenegro')&\
                     (df_yield["Country"]!='Sudan (former)')&(df_yield["Country"]!='USSR')&\
                     (df_yield["Country"]!='Wallis and Futuna Islands')&(df_yield["Country"]!='Yugoslav SFR')]

In [10]:
df_yield

           Country   Item  Year  Yield (hg/ha)
0      Afghanistan  Maize  1961          14000
1      Afghanistan  Maize  1962          14000
2      Afghanistan  Maize  1963          14260
3      Afghanistan  Maize  1964          14257
4      Afghanistan  Maize  1965          14400
...            ...    ...   ...            ...
56712     Zimbabwe  Wheat  2012          24420
56713     Zimbabwe  Wheat  2013          22888
56714     Zimbabwe  Wheat  2014          21357
56715     Zimbabwe  Wheat  2015          19826
56716     Zimbabwe  Wheat  2016          18294

[51297 rows x 4 columns]

In [11]:
# Change the name of countries to correct format
df_yield=df_yield.replace({'Bolivia (Plurinational State of)':"Bolivia",'Brunei Darussalam':"Brunei"\
                           ,"Democratic People's Republic of Korea":"North Korea","Iran (Islamic Republic of)":"Iran"\
                          ,'Micronesia (Federated States of)':"Micronesia","Lao People's Democratic Republic":"Laos"\
                          ,'Russian Federation':"Russia",'Syrian Arab Republic':'Syria','Republic of Korea':"South Korea"\
                          ,'United Republic of Tanzania':'Tanzania','Venezuela (Bolivarian Republic of)':"Venezuela"\
                          ,'Occupied Palestinian Territory':"Palestine State",'Viet Nam':'Vietnam'\
                          ,'Republic of Moldova':"Moldova",'The former Yugoslav Republic of Macedonia':"North Macedonia"})

In [12]:
df_yield['Country'].unique()

array(['Afghanistan', 'Albania', 'Algeria', 'Angola',
       'Antigua and Barbuda', 'Argentina', 'Armenia', 'Australia',
       'Austria', 'Azerbaijan', 'Bahamas', 'Bahrain', 'Bangladesh',
       'Barbados', 'Belarus', 'Belgium', 'Belize', 'Benin', 'Bhutan',
       'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Brunei', 'Bulgaria', 'Burkina Faso', 'Burundi', 'Cabo Verde',
       'Cambodia', 'Cameroon', 'Canada', 'Central African Republic',
       'Chad', 'Chile', 'China', 'Colombia', 'Comoros', 'Congo',
       'Costa Rica', "CÃ´te d'Ivoire", 'Croatia', 'Cuba', 'Cyprus',
       'Czechia', 'North Korea', 'Democratic Republic of the Congo',
       'Denmark', 'Djibouti', 'Dominica', 'Dominican Republic', 'Ecuador',
       'Egypt', 'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Estonia',
       'Ethiopia', 'Fiji', 'Finland', 'France', 'Gabon', 'Gambia',
       'Georgia', 'Germany', 'Ghana', 'Greece', 'Grenada', 'Guatemala',
       'Guinea', 'Guinea-Bissau', 'Guyana', 'Haiti', 'Honduras',
       'Hungary', 'Iceland', 'India', 'Indonesia', 'Iran', 'Iraq',
       'Ireland', 'Israel', 'Italy', 'Jamaica', 'Japan', 'Jordan',
       'Kazakhstan', 'Kenya', 'Kuwait', 'Kyrgyzstan', 'Laos', 'Latvia',
       'Lebanon', 'Lesotho', 'Liberia', 'Libya', 'Lithuania',
       'Luxembourg', 'Madagascar', 'Malawi', 'Malaysia', 'Maldives',
       'Mali', 'Malta', 'Mauritania', 'Mauritius', 'Mexico', 'Micronesia',
       'Mongolia', 'Montenegro', 'Morocco', 'Mozambique', 'Myanmar',
       'Namibia', 'Nepal', 'Netherlands', 'New Zealand', 'Nicaragua',
       'Niger', 'Nigeria', 'Norway', 'Palestine State', 'Oman',
       'Pakistan', 'Panama', 'Papua New Guinea', 'Paraguay', 'Peru',
       'Philippines', 'Poland', 'Portugal', 'Qatar', 'South Korea',
       'Moldova', 'Romania', 'Russia', 'Rwanda', 'Saint Kitts and Nevis',
       'Saint Lucia', 'Saint Vincent and the Grenadines', 'Samoa',
       'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Seychelles', 'Sierra Leone', 'Singapore', 'Slovakia', 'Slovenia',
       'Solomon Islands', 'Somalia', 'South Africa', 'South Sudan',
       'Spain', 'Sri Lanka', 'Sudan', 'Suriname', 'Eswatini', 'Sweden',
       'Switzerland', 'Syria', 'Tajikistan', 'Thailand',
       'North Macedonia', 'Timor-Leste', 'Togo', 'Tonga',
       'Trinidad and Tobago', 'Tunisia', 'Turkey', 'Turkmenistan',
       'Uganda', 'Ukraine', 'United Arab Emirates', 'United Kingdom',
       'Tanzania', 'United States of America', 'Uruguay', 'Uzbekistan',
       'Vanuatu', 'Venezuela', 'Vietnam', 'Yemen', 'Zambia', 'Zimbabwe'],
      dtype=object)

In [13]:
df_yield["Country"].nunique()

185

In [14]:
#list of unique years
df_yield["Year"].unique()

array([1961, 1962, 1963, 1964, 1965, 1966, 1967, 1968, 1969, 1970, 1971,
       1972, 1973, 1974, 1975, 1976, 1977, 1978, 1979, 1980, 1981, 1982,
       1983, 1984, 1985, 1986, 1987, 1988, 1989, 1990, 1991, 1992, 1993,
       1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004,
       2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015,
       2016], dtype=int64)

In [15]:
# number of unique years
df_yield["Year"].nunique()

56

In [16]:
# list of unique crops
df_yield["Item"].unique()

array(['Maize', 'Potatoes', 'Rice, paddy', 'Wheat', 'Sorghum', 'Soybeans',
       'Cassava', 'Sweet potatoes', 'Yams', 'Plantains and others'],
      dtype=object)

In [17]:
# number of unique crops
df_yield["Item"].nunique()

10

In [18]:
# check for duplicated values
df_yield[df_yield.duplicated()==True]

Empty DataFrame
Columns: [Country, Item, Year, Yield (hg/ha)]
Index: []

In [19]:
df_yield.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 51297 entries, 0 to 56716
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Country        51297 non-null  object
 1   Item           51297 non-null  object
 2   Year           51297 non-null  int64
 3   Yield (hg/ha)  51297 non-null  int64
dtypes: int64(2), object(2)
memory usage: 2.0+ MB

In [20]:
df_yield.describe()

               Year   Yield (hg/ha)
count  51297.000000    51297.000000
mean    1990.041854    60689.400589
std       16.135467    67618.802402
min     1961.000000        0.000000
25%     1976.000000    15000.000000
50%     1991.000000    35204.000000
75%     2004.000000    83093.000000
max     2016.000000  1000000.000000

In [21]:
# finding rows with zero yield
df_yield[df_yield["Yield (hg/ha)"]==0]

               Country     Item  Year  Yield (hg/ha)
37860  Palestine State  Sorghum  1999              0

In [22]:
# removing zero yield rows from dataframe
df_yield=df_yield[df_yield["Yield (hg/ha)"]!=0]

In [23]:
df_yield

           Country   Item  Year  Yield (hg/ha)
0      Afghanistan  Maize  1961          14000
1      Afghanistan  Maize  1962          14000
2      Afghanistan  Maize  1963          14260
3      Afghanistan  Maize  1964          14257
4      Afghanistan  Maize  1965          14400
...            ...    ...   ...            ...
56712     Zimbabwe  Wheat  2012          24420
56713     Zimbabwe  Wheat  2013          22888
56714     Zimbabwe  Wheat  2014          21357
56715     Zimbabwe  Wheat  2015          19826
56716     Zimbabwe  Wheat  2016          18294

[51296 rows x 4 columns]

In [24]:
# summation of null values
df_yield.isnull().sum()

Country          0
Item             0
Year             0
Yield (hg/ha)    0
dtype: int64

In [25]:
df_yield.isna().sum()

Country          0
Item             0
Year             0
Yield (hg/ha)    0
dtype: int64

In [26]:
df_rain=pd.read_csv("rainfall.csv")

In [27]:
df_rain

             Area  Year average_rain_fall_mm_per_year
0     Afghanistan  1985                           327
1     Afghanistan  1986                           327
2     Afghanistan  1987                           327
3     Afghanistan  1989                           327
4     Afghanistan  1990                           327
...           ...   ...                           ...
6722     Zimbabwe  2013                           657
6723     Zimbabwe  2014                           657
6724     Zimbabwe  2015                           657
6725     Zimbabwe  2016                           657
6726     Zimbabwe  2017                           657

[6727 rows x 3 columns]

In [28]:
# rename columns
df_rain = df_rain.rename(columns={" Area":"Country","average_rain_fall_mm_per_year":"Average Rainfall (mm/year)"})

In [29]:
df_rain

          Country  Year Average Rainfall (mm/year)
0     Afghanistan  1985                        327
1     Afghanistan  1986                        327
2     Afghanistan  1987                        327
3     Afghanistan  1989                        327
4     Afghanistan  1990                        327
...           ...   ...                        ...
6722     Zimbabwe  2013                        657
6723     Zimbabwe  2014                        657
6724     Zimbabwe  2015                        657
6725     Zimbabwe  2016                        657
6726     Zimbabwe  2017                        657

[6727 rows x 3 columns]

In [30]:
df_rain["Country"].nunique()

217

In [31]:
df_rain["Country"].unique()

array(['Afghanistan', 'Albania', 'Algeria', 'American Samoa', 'Andorra',
       'Angola', 'Antigua and Barbuda', 'Argentina', 'Armenia', 'Aruba',
       'Australia', 'Austria', 'Azerbaijan', 'Bahamas', 'Bahrain',
       'Bangladesh', 'Barbados', 'Belarus', 'Belgium', 'Belize', 'Benin',
       'Bermuda', 'Bhutan', 'Bolivia', 'Bosnia and Herzegovina',
       'Botswana', 'Brazil', 'British Virgin Islands',
       'Brunei Darussalam', 'Bulgaria', 'Burkina Faso', 'Burundi',
       'Cabo Verde', 'Cambodia', 'Cameroon', 'Canada', 'Cayman Islands',
       'Central African Republic', 'Chad', 'Channel Islands', 'Chile',
       'China', 'Colombia', 'Comoros', 'Congo, Dem. Rep.', 'Congo, Rep.',
       'Costa Rica', "Cote d'Ivoire", 'Croatia', 'Cuba', 'Curacao',
       'Cyprus', 'Czech Republic', 'Denmark', 'Djibouti', 'Dominica',
       'Dominican Republic', 'Ecuador', 'Egypt', 'El Salvador',
       'Equatorial Guinea', 'Eritrea', 'Estonia', 'Eswatini', 'Ethiopia',
       'Faroe Islands', 'Fiji', 'Finland', 'France', 'French Polynesia',
       'Gabon', 'Gambia', 'Georgia', 'Germany', 'Ghana', 'Gibraltar',
       'Greece', 'Greenland', 'Grenada', 'Guam', 'Guatemala', 'Guinea',
       'Guinea-Bissau', 'Guyana', 'Haiti', 'Honduras',
       'Hong Kong SAR, China', 'Hungary', 'Iceland', 'India', 'Indonesia',
       'Iran', 'Iraq', 'Ireland', 'Isle of Man', 'Israel', 'Italy',
       'Jamaica', 'Japan', 'Jordan', 'Kazakhstan', 'Kenya', 'Kiribati',
       'North Korea', 'South Korea ', 'Kosovo', 'Kuwait',
       'Kyrgyz Republic', 'Lao PDR', 'Latvia', 'Lebanon', 'Lesotho',
       'Liberia', 'Libya', 'Liechtenstein', 'Lithuania', 'Luxembourg',
       'Macao SAR, China', 'Macedonia', 'Madagascar', 'Malawi',
       'Malaysia', 'Maldives', 'Mali', 'Malta', 'Marshall Islands',
       'Mauritania', 'Mauritius', 'Mexico', 'Micronesia', 'Moldova',
       'Monaco', 'Mongolia', 'Montenegro', 'Morocco', 'Mozambique',
       'Myanmar', 'Namibia', 'Nauru', 'Nepal', 'Netherlands',
       'New Caledonia', 'New Zealand', 'Nicaragua', 'Niger', 'Nigeria',
       'Northern Mariana Islands', 'Norway', 'Oman', 'Pakistan', 'Palau',
       'Panama', 'Papua New Guinea', 'Paraguay', 'Peru', 'Philippines',
       'Poland', 'Portugal', 'Puerto Rico', 'Qatar', 'Romania', 'Russia',
       'Rwanda', 'Samoa', 'San Marino', 'Sao Tome and Principe',
       'Saudi Arabia', 'Senegal', 'Serbia', 'Seychelles', 'Sierra Leone',
       'Singapore', 'Sint Maarten (Dutch part)', 'Slovak Republic',
       'Slovenia', 'Solomon Islands', 'Somalia', 'South Africa',
       'South Sudan', 'Spain', 'Sri Lanka', 'St. Kitts and Nevis',
       'St. Lucia', 'St. Martin (French part)',
       'St. Vincent and the Grenadines', 'Sudan', 'Suriname', 'Sweden',
       'Switzerland', 'Syria', 'Tajikistan', 'Tanzania', 'Thailand',
       'Timor-Leste', 'Togo', 'Tonga', 'Trinidad and Tobago', 'Tunisia',
       'Turkey', 'Turkmenistan', 'Turks and Caicos Islands', 'Tuvalu',
       'Uganda', 'Ukraine', 'United Arab Emirates', 'United Kingdom',
       'United States', 'Uruguay', 'Uzbekistan', 'Vanuatu',
       'Venezuela, RB', 'Vietnam', 'Virgin Islands (U.S.)',
       'West Bank and Gaza', 'Yemen', 'Zambia', 'Zimbabwe'], dtype=object)

In [32]:
df_rain=df_rain.loc[(df_rain["Country"]!='American Samoa')&(df_rain["Country"]!='Aruba')&\
                    (df_rain["Country"]!='Bermuda')&(df_rain["Country"]!='American Samoa')&\
                    (df_rain["Country"]!='British Virgin Islands')&(df_rain["Country"]!='Cayman Islands')&\
                    (df_rain["Country"]!='Channel Islands')&(df_rain["Country"]!='Curacao')&\
                    (df_rain["Country"]!='Faroe Islands')&(df_rain["Country"]!='French Polynesia')&\
                    (df_rain["Country"]!='Gibraltar')&(df_rain["Country"]!='Guam')&\
                    (df_rain["Country"]!='Greenland')&(df_rain["Country"]!='Isle of Man')&\
                    (df_rain["Country"]!='Kosovo')&(df_rain["Country"]!='Macao SAR, China')&\
                    (df_rain["Country"]!='Northern Mariana Islands')&(df_rain["Country"]!='New Caledonia')&\
                    (df_rain["Country"]!='Puerto Rico')&(df_rain["Country"]!='Sint Maarten (Dutch part)')&\
                    (df_rain["Country"]!='St. Martin (French part)')&(df_rain["Country"]!='Virgin Islands (U.S.)')&\
                    (df_rain["Country"]!='Turks and Caicos Islands')&(df_rain["Country"]!='Sint Maarten (Dutch part)')&\
                    (df_rain["Country"]!='West Bank and Gaza')&(df_rain["Country"]!='Hong Kong SAR, China')]

In [33]:
df_rain['Country'].unique()

array(['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola',
       'Antigua and Barbuda', 'Argentina', 'Armenia', 'Australia',
       'Austria', 'Azerbaijan', 'Bahamas', 'Bahrain', 'Bangladesh',
       'Barbados', 'Belarus', 'Belgium', 'Belize', 'Benin', 'Bhutan',
       'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Brunei Darussalam', 'Bulgaria', 'Burkina Faso', 'Burundi',
       'Cabo Verde', 'Cambodia', 'Cameroon', 'Canada',
       'Central African Republic', 'Chad', 'Chile', 'China', 'Colombia',
       'Comoros', 'Congo, Dem. Rep.', 'Congo, Rep.', 'Costa Rica',
       "Cote d'Ivoire", 'Croatia', 'Cuba', 'Cyprus', 'Czech Republic',
       'Denmark', 'Djibouti', 'Dominica', 'Dominican Republic', 'Ecuador',
       'Egypt', 'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Estonia',
       'Eswatini', 'Ethiopia', 'Fiji', 'Finland', 'France', 'Gabon',
       'Gambia', 'Georgia', 'Germany', 'Ghana', 'Greece', 'Grenada',
       'Guatemala', 'Guinea', 'Guinea-Bissau', 'Guyana', 'Haiti',
       'Honduras', 'Hungary', 'Iceland', 'India', 'Indonesia', 'Iran',
       'Iraq', 'Ireland', 'Israel', 'Italy', 'Jamaica', 'Japan', 'Jordan',
       'Kazakhstan', 'Kenya', 'Kiribati', 'North Korea', 'South Korea ',
       'Kuwait', 'Kyrgyz Republic', 'Lao PDR', 'Latvia', 'Lebanon',
       'Lesotho', 'Liberia', 'Libya', 'Liechtenstein', 'Lithuania',
       'Luxembourg', 'Macedonia', 'Madagascar', 'Malawi', 'Malaysia',
       'Maldives', 'Mali', 'Malta', 'Marshall Islands', 'Mauritania',
       'Mauritius', 'Mexico', 'Micronesia', 'Moldova', 'Monaco',
       'Mongolia', 'Montenegro', 'Morocco', 'Mozambique', 'Myanmar',
       'Namibia', 'Nauru', 'Nepal', 'Netherlands', 'New Zealand',
       'Nicaragua', 'Niger', 'Nigeria', 'Norway', 'Oman', 'Pakistan',
       'Palau', 'Panama', 'Papua New Guinea', 'Paraguay', 'Peru',
       'Philippines', 'Poland', 'Portugal', 'Qatar', 'Romania', 'Russia',
       'Rwanda', 'Samoa', 'San Marino', 'Sao Tome and Principe',
       'Saudi Arabia', 'Senegal', 'Serbia', 'Seychelles', 'Sierra Leone',
       'Singapore', 'Slovak Republic', 'Slovenia', 'Solomon Islands',
       'Somalia', 'South Africa', 'South Sudan', 'Spain', 'Sri Lanka',
       'St. Kitts and Nevis', 'St. Lucia',
       'St. Vincent and the Grenadines', 'Sudan', 'Suriname', 'Sweden',
       'Switzerland', 'Syria', 'Tajikistan', 'Tanzania', 'Thailand',
       'Timor-Leste', 'Togo', 'Tonga', 'Trinidad and Tobago', 'Tunisia',
       'Turkey', 'Turkmenistan', 'Tuvalu', 'Uganda', 'Ukraine',
       'United Arab Emirates', 'United Kingdom', 'United States',
       'Uruguay', 'Uzbekistan', 'Vanuatu', 'Venezuela, RB', 'Vietnam',
       'Yemen', 'Zambia', 'Zimbabwe'], dtype=object)

In [34]:
df_rain=df_rain.replace({'Brunei Darussalam':"Brunei",'Congo, Rep.':"Republic of the Congo",'Congo, Dem. Rep.':"Democratic Republic of the Congo"\
                           ,'Kyrgyz Republic':'Kyrgyzstan','United States':'United States of America','St. Kitts and Nevis':'Saint Kitts and Nevis'\
                          ,'Slovak Republic':"Slovakia",'Lao PDR':"Laos","Cote d'Ivoire":"CÃ´te d'Ivoire"\
                          ,'Venezuela, RB':"Venezuela",'Czech Republic':"Czechia"})

In [35]:
df_rain['Country'].unique()

array(['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola',
       'Antigua and Barbuda', 'Argentina', 'Armenia', 'Australia',
       'Austria', 'Azerbaijan', 'Bahamas', 'Bahrain', 'Bangladesh',
       'Barbados', 'Belarus', 'Belgium', 'Belize', 'Benin', 'Bhutan',
       'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Brunei', 'Bulgaria', 'Burkina Faso', 'Burundi', 'Cabo Verde',
       'Cambodia', 'Cameroon', 'Canada', 'Central African Republic',
       'Chad', 'Chile', 'China', 'Colombia', 'Comoros',
       'Democratic Republic of the Congo', 'Republic of the Congo',
       'Costa Rica', "CÃ´te d'Ivoire", 'Croatia', 'Cuba', 'Cyprus',
       'Czechia', 'Denmark', 'Djibouti', 'Dominica', 'Dominican Republic',
       'Ecuador', 'Egypt', 'El Salvador', 'Equatorial Guinea', 'Eritrea',
       'Estonia', 'Eswatini', 'Ethiopia', 'Fiji', 'Finland', 'France',
       'Gabon', 'Gambia', 'Georgia', 'Germany', 'Ghana', 'Greece',
       'Grenada', 'Guatemala', 'Guinea', 'Guinea-Bissau', 'Guyana',
       'Haiti', 'Honduras', 'Hungary', 'Iceland', 'India', 'Indonesia',
       'Iran', 'Iraq', 'Ireland', 'Israel', 'Italy', 'Jamaica', 'Japan',
       'Jordan', 'Kazakhstan', 'Kenya', 'Kiribati', 'North Korea',
       'South Korea ', 'Kuwait', 'Kyrgyzstan', 'Laos', 'Latvia',
       'Lebanon', 'Lesotho', 'Liberia', 'Libya', 'Liechtenstein',
       'Lithuania', 'Luxembourg', 'Macedonia', 'Madagascar', 'Malawi',
       'Malaysia', 'Maldives', 'Mali', 'Malta', 'Marshall Islands',
       'Mauritania', 'Mauritius', 'Mexico', 'Micronesia', 'Moldova',
       'Monaco', 'Mongolia', 'Montenegro', 'Morocco', 'Mozambique',
       'Myanmar', 'Namibia', 'Nauru', 'Nepal', 'Netherlands',
       'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Norway', 'Oman',
       'Pakistan', 'Palau', 'Panama', 'Papua New Guinea', 'Paraguay',
       'Peru', 'Philippines', 'Poland', 'Portugal', 'Qatar', 'Romania',
       'Russia', 'Rwanda', 'Samoa', 'San Marino', 'Sao Tome and Principe',
       'Saudi Arabia', 'Senegal', 'Serbia', 'Seychelles', 'Sierra Leone',
       'Singapore', 'Slovakia', 'Slovenia', 'Solomon Islands', 'Somalia',
       'South Africa', 'South Sudan', 'Spain', 'Sri Lanka',
       'Saint Kitts and Nevis', 'St. Lucia',
       'St. Vincent and the Grenadines', 'Sudan', 'Suriname', 'Sweden',
       'Switzerland', 'Syria', 'Tajikistan', 'Tanzania', 'Thailand',
       'Timor-Leste', 'Togo', 'Tonga', 'Trinidad and Tobago', 'Tunisia',
       'Turkey', 'Turkmenistan', 'Tuvalu', 'Uganda', 'Ukraine',
       'United Arab Emirates', 'United Kingdom',
       'United States of America', 'Uruguay', 'Uzbekistan', 'Vanuatu',
       'Venezuela', 'Vietnam', 'Yemen', 'Zambia', 'Zimbabwe'],
      dtype=object)

In [36]:
df_rain['Country'].nunique()

193

In [37]:
df_rain["Year"].unique()

array([1985, 1986, 1987, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996,
       1997, 1998, 1999, 2000, 2001, 2002, 2004, 2005, 2006, 2007, 2008,
       2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017], dtype=int64)

In [38]:
df_rain["Year"].nunique()

31

In [39]:
df_rain[df_rain.duplicated()==True]

Empty DataFrame
Columns: [Country, Year, Average Rainfall (mm/year)]
Index: []

In [40]:
df_rain['Average Rainfall (mm/year)'].nunique()

171

In [41]:
df_rain.isnull().sum()

Country                        0
Year                           0
Average Rainfall (mm/year)    92
dtype: int64

In [42]:
df_rain.isna().sum()

Country                        0
Year                           0
Average Rainfall (mm/year)    92
dtype: int64

In [43]:
df_rain.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5983 entries, 0 to 6726
Data columns (total 3 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Country                     5983 non-null   object
 1   Year                        5983 non-null   int64
 2   Average Rainfall (mm/year)  5891 non-null   object
dtypes: int64(1), object(2)
memory usage: 187.0+ KB

In [44]:
# Changing Average Rainfall (mm/year) datatype from object to float
df_rain['Average Rainfall (mm/year)'] = pd.to_numeric(df_rain['Average Rainfall (mm/year)'],errors = 'coerce')
df_rain.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5983 entries, 0 to 6726
Data columns (total 3 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Country                     5983 non-null   object
 1   Year                        5983 non-null   int64
 2   Average Rainfall (mm/year)  5885 non-null   float64
dtypes: float64(1), int64(1), object(1)
memory usage: 187.0+ KB

In [45]:
# drop null values
df_rain = df_rain.dropna()

In [46]:
# Changing Average Rainfall (mm/year) datatype from float to int
df_rain['Average Rainfall (mm/year)']=df_rain['Average Rainfall (mm/year)'].astype(int)

In [47]:
df_rain.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5885 entries, 0 to 6726
Data columns (total 3 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Country                     5885 non-null   object
 1   Year                        5885 non-null   int64
 2   Average Rainfall (mm/year)  5885 non-null   int32
dtypes: int32(1), int64(1), object(1)
memory usage: 160.9+ KB

In [48]:
df_rain.describe()

              Year  Average Rainfall (mm/year)
count  5885.000000                 5885.000000
mean   2001.366015                 1123.655395
std       9.526303                  785.755655
min    1985.000000                   51.000000
25%    1993.000000                  536.000000
50%    2001.000000                 1010.000000
75%    2010.000000                 1646.000000
max    2017.000000                 3240.000000

In [49]:
df_rain

          Country  Year  Average Rainfall (mm/year)
0     Afghanistan  1985                         327
1     Afghanistan  1986                         327
2     Afghanistan  1987                         327
3     Afghanistan  1989                         327
4     Afghanistan  1990                         327
...           ...   ...                         ...
6722     Zimbabwe  2013                         657
6723     Zimbabwe  2014                         657
6724     Zimbabwe  2015                         657
6725     Zimbabwe  2016                         657
6726     Zimbabwe  2017                         657

[5885 rows x 3 columns]

In [50]:
df_pes=pd.read_csv("pesticides.csv")

In [51]:
df_pes

,Domain,Area,Element,Item,Year,Unit,Value
0,Pesticides Use,Albania,Use,Pesticides (total),1990,tonnes of active ingredients,121.00
1,Pesticides Use,Albania,Use,Pesticides (total),1991,tonnes of active ingredients,121.00
2,Pesticides Use,Albania,Use,Pesticides (total),1992,tonnes of active ingredients,121.00
3,Pesticides Use,Albania,Use,Pesticides (total),1993,tonnes of active ingredients,121.00
4,Pesticides Use,Albania,Use,Pesticides (total),1994,tonnes of active ingredients,201.00
...,...,...,...,...,...,...,...
4344,Pesticides Use,Zimbabwe,Use,Pesticides (total),2012,tonnes of active ingredients,3375.53
4345,Pesticides Use,Zimbabwe,Use,Pesticides (total),2013,tonnes of active ingredients,2550.07
4346,Pesticides Use,Zimbabwe,Use,Pesticides (total),2014,tonnes of active ingredients,2185.07
4347,Pesticides Use,Zimbabwe,Use,Pesticides (total),2015,tonnes of active ingredients,2185.07
4348,Pesticides Use,Zimbabwe,Use,Pesticides (total),2016,tonnes of active ingredients,2185.07

In [52]:
df_pes = df_pes.drop(['Element','Domain','Unit','Item'], axis=1)

In [53]:
df_pes

          Area  Year    Value
0      Albania  1990   121.00
1      Albania  1991   121.00
2      Albania  1992   121.00
3      Albania  1993   121.00
4      Albania  1994   201.00
...        ...   ...      ...
4344  Zimbabwe  2012  3375.53
4345  Zimbabwe  2013  2550.07
4346  Zimbabwe  2014  2185.07
4347  Zimbabwe  2015  2185.07
4348  Zimbabwe  2016  2185.07

[4349 rows x 3 columns]

In [54]:
df_pes = df_pes.rename(columns={"Value": "Pesticides (Tonnes)","Area":"Country"})

In [55]:
df_pes

       Country  Year  Pesticides (Tonnes)
0      Albania  1990               121.00
1      Albania  1991               121.00
2      Albania  1992               121.00
3      Albania  1993               121.00
4      Albania  1994               201.00
...        ...   ...                  ...
4344  Zimbabwe  2012              3375.53
4345  Zimbabwe  2013              2550.07
4346  Zimbabwe  2014              2185.07
4347  Zimbabwe  2015              2185.07
4348  Zimbabwe  2016              2185.07

[4349 rows x 3 columns]

In [56]:
df_pes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4349 entries, 0 to 4348
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Country              4349 non-null   object
 1   Year                 4349 non-null   int64
 2   Pesticides (Tonnes)  4349 non-null   float64
dtypes: float64(1), int64(1), object(1)
memory usage: 102.1+ KB

In [57]:
df_pes["Country"].nunique()

168

In [58]:
df_pes["Country"].unique()

array(['Albania', 'Algeria', 'Angola', 'Antigua and Barbuda', 'Argentina',
       'Armenia', 'Australia', 'Austria', 'Azerbaijan', 'Bahamas',
       'Bahrain', 'Bangladesh', 'Barbados', 'Belarus', 'Belgium',
       'Belgium-Luxembourg', 'Belize', 'Bermuda', 'Bhutan',
       'Bolivia (Plurinational State of)', 'Botswana', 'Brazil',
       'Brunei Darussalam', 'Bulgaria', 'Burkina Faso', 'Burundi',
       'Cabo Verde', 'Cameroon', 'Canada', 'Central African Republic',
       'Chad', 'Chile', 'China, Hong Kong SAR', 'China, Macao SAR',
       'China, mainland', 'China, Taiwan Province of', 'Colombia',
       'Comoros', 'Congo', 'Cook Islands', 'Costa Rica', "CÃ´te d'Ivoire",
       'Croatia', 'Cyprus', 'Czechia', 'Denmark', 'Dominican Republic',
       'Ecuador', 'Egypt', 'El Salvador', 'Eritrea', 'Estonia',
       'Ethiopia', 'Fiji', 'Finland', 'France', 'French Polynesia',
       'Gambia', 'Germany', 'Ghana', 'Greece', 'Guatemala', 'Guinea',
       'Guinea-Bissau', 'Guyana', 'Haiti', 'Honduras', 'Hungary',
       'Iceland', 'India', 'Indonesia', 'Iran (Islamic Republic of)',
       'Iraq', 'Ireland', 'Israel', 'Italy', 'Jamaica', 'Japan', 'Jordan',
       'Kazakhstan', 'Kenya', 'Kuwait', 'Kyrgyzstan',
       "Lao People's Democratic Republic", 'Latvia', 'Lebanon', 'Lesotho',
       'Libya', 'Lithuania', 'Luxembourg', 'Madagascar', 'Malawi',
       'Malaysia', 'Maldives', 'Mali', 'Malta', 'Mauritania', 'Mauritius',
       'Mexico', 'Montenegro', 'Morocco', 'Mozambique', 'Myanmar',
       'Namibia', 'Nepal', 'Netherlands', 'New Caledonia', 'New Zealand',
       'Nicaragua', 'Niger', 'Norway', 'Occupied Palestinian Territory',
       'Oman', 'Pakistan', 'Panama', 'Papua New Guinea', 'Paraguay',
       'Peru', 'Poland', 'Portugal', 'Qatar', 'Republic of Korea',
       'Republic of Moldova', 'Romania', 'Russian Federation', 'Rwanda',
       'Saint Kitts and Nevis', 'Saint Lucia', 'Samoa', 'Saudi Arabia',
       'Senegal', 'Serbia and Montenegro', 'Seychelles', 'Slovakia',
       'Slovenia', 'South Africa', 'Spain', 'Sri Lanka', 'Sudan',
       'Sudan (former)', 'Suriname', 'Sweden', 'Switzerland',
       'Syrian Arab Republic', 'Tajikistan', 'Thailand',
       'The former Yugoslav Republic of Macedonia', 'Timor-Leste', 'Togo',
       'Tonga', 'Trinidad and Tobago', 'Tunisia', 'Turkey',
       'Turkmenistan', 'Uganda', 'Ukraine', 'United Kingdom',
       'United Republic of Tanzania', 'United States of America',
       'Uruguay', 'USSR', 'Vanuatu', 'Venezuela (Bolivarian Republic of)',
       'Viet Nam', 'Yemen', 'Yugoslav SFR', 'Zambia', 'Zimbabwe'],
      dtype=object)

In [59]:
df_pes=df_pes.loc[(df_pes["Country"]!='Belgium-Luxembourg')&(df_pes["Country"]!='Bermuda')&\
                  (df_pes["Country"]!='China, Hong Kong SAR')&\
                  (df_pes["Country"]!='China, Taiwan Province of')&(df_pes["Country"]!='China, Macao SAR')&\
                  (df_pes["Country"]!='French Polynesia')&(df_pes["Country"]!='New Caledonia')&\
                  (df_pes["Country"]!='Sudan (former)')&(df_pes["Country"]!='USSR')&\
                  (df_pes["Country"]!='Yugoslav SFR')&(df_pes["Country"]!='Cook Islands')]

In [60]:
df_pes=df_pes.replace({'Brunei Darussalam':"Brunei",'Bolivia (Plurinational State of)':"Bolivia",\
                       'Congo':'Democratic Republic of the Congo',
                       'Iran (Islamic Republic of)':"Iran","Lao People's Democratic Republic":"Laos",\
                       'Occupied Palestinian Territory':"Palestine State",'Republic of Korea':"South Korea",\
                       'Republic of Moldova':"Moldova",'Russian Federation':"Russia",'Syrian Arab Republic':"Syria",\
                       'The former Yugoslav Republic of Macedonia':"North Macedonia",'United Republic of Tanzania':"Tanzania"\
                       ,'Venezuela (Bolivarian Republic of)':"Venezuela",'Viet Nam':"Vietnam",'China, mainland':'China'})

In [61]:
df_pes["Country"].unique()

array(['Albania', 'Algeria', 'Angola', 'Antigua and Barbuda', 'Argentina',
       'Armenia', 'Australia', 'Austria', 'Azerbaijan', 'Bahamas',
       'Bahrain', 'Bangladesh', 'Barbados', 'Belarus', 'Belgium',
       'Belize', 'Bhutan', 'Bolivia', 'Botswana', 'Brazil', 'Brunei',
       'Bulgaria', 'Burkina Faso', 'Burundi', 'Cabo Verde', 'Cameroon',
       'Canada', 'Central African Republic', 'Chad', 'Chile', 'China',
       'Colombia', 'Comoros', 'Democratic Republic of the Congo',
       'Costa Rica', "CÃ´te d'Ivoire", 'Croatia', 'Cyprus', 'Czechia',
       'Denmark', 'Dominican Republic', 'Ecuador', 'Egypt', 'El Salvador',
       'Eritrea', 'Estonia', 'Ethiopia', 'Fiji', 'Finland', 'France',
       'Gambia', 'Germany', 'Ghana', 'Greece', 'Guatemala', 'Guinea',
       'Guinea-Bissau', 'Guyana', 'Haiti', 'Honduras', 'Hungary',
       'Iceland', 'India', 'Indonesia', 'Iran', 'Iraq', 'Ireland',
       'Israel', 'Italy', 'Jamaica', 'Japan', 'Jordan', 'Kazakhstan',
       'Kenya', 'Kuwait', 'Kyrgyzstan', 'Laos', 'Latvia', 'Lebanon',
       'Lesotho', 'Libya', 'Lithuania', 'Luxembourg', 'Madagascar',
       'Malawi', 'Malaysia', 'Maldives', 'Mali', 'Malta', 'Mauritania',
       'Mauritius', 'Mexico', 'Montenegro', 'Morocco', 'Mozambique',
       'Myanmar', 'Namibia', 'Nepal', 'Netherlands', 'New Zealand',
       'Nicaragua', 'Niger', 'Norway', 'Palestine State', 'Oman',
       'Pakistan', 'Panama', 'Papua New Guinea', 'Paraguay', 'Peru',
       'Poland', 'Portugal', 'Qatar', 'South Korea', 'Moldova', 'Romania',
       'Russia', 'Rwanda', 'Saint Kitts and Nevis', 'Saint Lucia',
       'Samoa', 'Saudi Arabia', 'Senegal', 'Serbia and Montenegro',
       'Seychelles', 'Slovakia', 'Slovenia', 'South Africa', 'Spain',
       'Sri Lanka', 'Sudan', 'Suriname', 'Sweden', 'Switzerland', 'Syria',
       'Tajikistan', 'Thailand', 'North Macedonia', 'Timor-Leste', 'Togo',
       'Tonga', 'Trinidad and Tobago', 'Tunisia', 'Turkey',
       'Turkmenistan', 'Uganda', 'Ukraine', 'United Kingdom', 'Tanzania',
       'United States of America', 'Uruguay', 'Vanuatu', 'Venezuela',
       'Vietnam', 'Yemen', 'Zambia', 'Zimbabwe'], dtype=object)

In [62]:
df_pes["Country"].nunique()

157

In [63]:
df_pes["Year"].nunique()

27

In [64]:
df_pes["Year"].unique()

array([1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000,
       2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011,
       2012, 2013, 2014, 2015, 2016], dtype=int64)

In [65]:
df_pes.isnull().sum()

Country                0
Year                   0
Pesticides (Tonnes)    0
dtype: int64

In [66]:
df_pes[df_pes.duplicated()==True]

Empty DataFrame
Columns: [Country, Year, Pesticides (Tonnes)]
Index: []

In [67]:
df_pes.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4124 entries, 0 to 4348
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Country              4124 non-null   object
 1   Year                 4124 non-null   int64
 2   Pesticides (Tonnes)  4124 non-null   float64
dtypes: float64(1), int64(1), object(1)
memory usage: 128.9+ KB

In [68]:
df_pes.describe()

              Year  Pesticides (Tonnes)
count  4124.000000         4.124000e+03
mean   2003.192532         2.127415e+04
std       7.719386         1.208128e+05
min    1990.000000         0.000000e+00
25%    1997.000000         1.078825e+02
50%    2003.000000         1.288075e+03
75%    2010.000000         8.232025e+03
max    2016.000000         1.807000e+06

In [69]:
df_pes

       Country  Year  Pesticides (Tonnes)
0      Albania  1990               121.00
1      Albania  1991               121.00
2      Albania  1992               121.00
3      Albania  1993               121.00
4      Albania  1994               201.00
...        ...   ...                  ...
4344  Zimbabwe  2012              3375.53
4345  Zimbabwe  2013              2550.07
4346  Zimbabwe  2014              2185.07
4347  Zimbabwe  2015              2185.07
4348  Zimbabwe  2016              2185.07

[4124 rows x 3 columns]

In [70]:
df_temp=pd.read_csv("temp.csv")

In [71]:
df_temp

       year        country  avg_temp
0      1849  CÃ´te D'Ivoire     25.58
1      1850  CÃ´te D'Ivoire     25.52
2      1851  CÃ´te D'Ivoire     25.67
3      1852  CÃ´te D'Ivoire       NaN
4      1853  CÃ´te D'Ivoire       NaN
...     ...            ...       ...
71306  2009         Mexico     21.76
71307  2010         Mexico     20.90
71308  2011         Mexico     21.55
71309  2012         Mexico     21.52
71310  2013         Mexico     22.19

[71311 rows x 3 columns]

In [72]:
df_temp = df_temp.rename(columns={"year": "Year","country":"Country","avg_temp":"Average Temperature"})

In [73]:
df_temp

       Year        Country  Average Temperature
0      1849  CÃ´te D'Ivoire                25.58
1      1850  CÃ´te D'Ivoire                25.52
2      1851  CÃ´te D'Ivoire                25.67
3      1852  CÃ´te D'Ivoire                  NaN
4      1853  CÃ´te D'Ivoire                  NaN
...     ...            ...                  ...
71306  2009         Mexico                21.76
71307  2010         Mexico                20.90
71308  2011         Mexico                21.55
71309  2012         Mexico                21.52
71310  2013         Mexico                22.19

[71311 rows x 3 columns]

In [74]:
df_temp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71311 entries, 0 to 71310
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Year                 71311 non-null  int64
 1   Country              71311 non-null  object
 2   Average Temperature  68764 non-null  float64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.6+ MB

In [75]:
df_temp["Country"].unique()

array(["CÃ´te D'Ivoire", 'United Arab Emirates', 'Nigeria', 'Ghana',
       'Turkey', 'Australia', 'India', 'United States', 'Egypt',
       'Algeria', 'Kazakhstan', 'Netherlands', 'China', 'Madagascar',
       'Eritrea', 'Greece', 'Iraq', 'Azerbaijan', 'Mali', 'Indonesia',
       'Thailand', 'Central African Republic', 'Spain', 'Venezuela',
       'Colombia', 'Lebanon', 'United Kingdom', 'Serbia', 'Brazil',
       'Libya', 'Germany', 'Switzerland', 'Guinea Bissau', 'Slovakia',
       'Congo', 'Belgium', 'Romania', 'Hungary', 'Burundi', 'Morocco',
       'Russia', 'Moldova', 'Sri Lanka', 'Guinea', 'Denmark', 'Argentina',
       'Senegal', 'Syria', 'Tanzania', 'Bangladesh', 'Qatar', 'Cameroon',
       'Ireland', 'South Africa', 'Tajikistan', 'Mexico', 'Pakistan',
       'Sierra Leone', 'Botswana', 'Guyana', 'Guatemala', 'Ecuador',
       'Vietnam', 'Zimbabwe', 'Finland', 'Japan', 'Sudan', 'Afghanistan',
       'Uganda', 'Taiwan', 'Nepal', 'Ukraine', 'Rwanda', 'Canada',
       'Jamaica', 'Congo (Democratic Republic Of The)', 'Malaysia',
       'Bolivia', 'Gabon', 'Malawi', 'Peru', 'Portugal', 'Slovenia',
       'Chile', 'Angola', 'Zambia', 'Equatorial Guinea', 'Nicaragua',
       'Bahrain', 'Philippines', 'Mozambique', 'Lesotho', 'Iran',
       'Saudi Arabia', 'Italy', 'Belarus', 'Somalia', 'Liberia',
       'Uruguay', 'Kenya', 'Bahamas', 'Niger', 'Mauritania', 'Norway',
       'Burkina Faso', 'Suriname', 'France', 'Montenegro', 'Haiti',
       'Mauritius', 'Papua New Guinea', 'Czech Republic', 'Latvia',
       'El Salvador', 'Dominican Republic', 'Bosnia And Herzegovina',
       'South Korea', 'Hong Kong', 'Singapore', 'Macedonia', 'Bulgaria',
       'Sweden', 'Estonia', 'Uzbekistan', 'Georgia', 'Honduras',
       'Albania', 'Tunisia', 'Mongolia', 'Austria', 'Laos', 'Lithuania',
       'Poland', 'New Zealand', 'Namibia', 'Armenia', 'Croatia'],
      dtype=object)

In [76]:
df_temp["Country"].nunique()

137

In [77]:
df_temp=df_temp.replace({'Guinea Bissau':'Guinea-Bissau','Congo':"Republic of Congo",'Congo (Democratic Republic Of The)'\
                       :"Democratic Republic of the Congo","Macedonia":"North Macedonia",'Czech Republic':"Czechia"\
                        ,'United States':'United States of America',"CÃ´te D'Ivoire":"CÃ´te d'Ivoire"})

In [78]:
df_temp["Country"].unique()

array(["CÃ´te d'Ivoire", 'United Arab Emirates', 'Nigeria', 'Ghana',
       'Turkey', 'Australia', 'India', 'United States of America',
       'Egypt', 'Algeria', 'Kazakhstan', 'Netherlands', 'China',
       'Madagascar', 'Eritrea', 'Greece', 'Iraq', 'Azerbaijan', 'Mali',
       'Indonesia', 'Thailand', 'Central African Republic', 'Spain',
       'Venezuela', 'Colombia', 'Lebanon', 'United Kingdom', 'Serbia',
       'Brazil', 'Libya', 'Germany', 'Switzerland', 'Guinea-Bissau',
       'Slovakia', 'Republic of Congo', 'Belgium', 'Romania', 'Hungary',
       'Burundi', 'Morocco', 'Russia', 'Moldova', 'Sri Lanka', 'Guinea',
       'Denmark', 'Argentina', 'Senegal', 'Syria', 'Tanzania',
       'Bangladesh', 'Qatar', 'Cameroon', 'Ireland', 'South Africa',
       'Tajikistan', 'Mexico', 'Pakistan', 'Sierra Leone', 'Botswana',
       'Guyana', 'Guatemala', 'Ecuador', 'Vietnam', 'Zimbabwe', 'Finland',
       'Japan', 'Sudan', 'Afghanistan', 'Uganda', 'Taiwan', 'Nepal',
       'Ukraine', 'Rwanda', 'Canada', 'Jamaica',
       'Democratic Republic of the Congo', 'Malaysia', 'Bolivia', 'Gabon',
       'Malawi', 'Peru', 'Portugal', 'Slovenia', 'Chile', 'Angola',
       'Zambia', 'Equatorial Guinea', 'Nicaragua', 'Bahrain',
       'Philippines', 'Mozambique', 'Lesotho', 'Iran', 'Saudi Arabia',
       'Italy', 'Belarus', 'Somalia', 'Liberia', 'Uruguay', 'Kenya',
       'Bahamas', 'Niger', 'Mauritania', 'Norway', 'Burkina Faso',
       'Suriname', 'France', 'Montenegro', 'Haiti', 'Mauritius',
       'Papua New Guinea', 'Czechia', 'Latvia', 'El Salvador',
       'Dominican Republic', 'Bosnia And Herzegovina', 'South Korea',
       'Hong Kong', 'Singapore', 'North Macedonia', 'Bulgaria', 'Sweden',
       'Estonia', 'Uzbekistan', 'Georgia', 'Honduras', 'Albania',
       'Tunisia', 'Mongolia', 'Austria', 'Laos', 'Lithuania', 'Poland',
       'New Zealand', 'Namibia', 'Armenia', 'Croatia'], dtype=object)

In [79]:
df_temp["Year"].nunique()

271

In [80]:
df_temp["Year"].unique()

array([1849, 1850, 1851, 1852, 1853, 1854, 1855, 1856, 1857, 1858, 1859,
       1860, 1861, 1862, 1863, 1864, 1865, 1866, 1867, 1868, 1869, 1870,
       1871, 1872, 1873, 1874, 1875, 1876, 1877, 1878, 1879, 1880, 1881,
       1882, 1883, 1884, 1885, 1886, 1887, 1888, 1889, 1890, 1891, 1892,
       1893, 1894, 1895, 1896, 1897, 1898, 1899, 1900, 1901, 1902, 1903,
       1904, 1905, 1906, 1907, 1908, 1909, 1910, 1911, 1912, 1913, 1914,
       1915, 1916, 1917, 1918, 1919, 1920, 1921, 1922, 1923, 1924, 1925,
       1926, 1927, 1928, 1929, 1930, 1931, 1932, 1933, 1934, 1935, 1936,
       1937, 1938, 1939, 1940, 1941, 1942, 1943, 1944, 1945, 1946, 1947,
       1948, 1949, 1950, 1951, 1952, 1953, 1954, 1955, 1956, 1957, 1958,
       1959, 1960, 1961, 1962, 1963, 1964, 1965, 1966, 1967, 1968, 1969,
       1970, 1971, 1972, 1973, 1974, 1975, 1976, 1977, 1978, 1979, 1980,
       1981, 1982, 1983, 1984, 1985, 1986, 1987, 1988, 1989, 1990, 1991,
       1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002,
       2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013,
       1843, 1844, 1845, 1846, 1847, 1848, 1791, 1792, 1793, 1794, 1795,
       1796, 1797, 1798, 1799, 1800, 1801, 1802, 1803, 1804, 1805, 1806,
       1807, 1808, 1809, 1810, 1811, 1812, 1813, 1814, 1815, 1816, 1817,
       1818, 1819, 1820, 1821, 1822, 1823, 1824, 1825, 1826, 1827, 1828,
       1829, 1830, 1831, 1832, 1833, 1834, 1835, 1836, 1837, 1838, 1839,
       1840, 1841, 1842, 1743, 1744, 1745, 1746, 1747, 1748, 1749, 1750,
       1751, 1752, 1753, 1754, 1755, 1756, 1757, 1758, 1759, 1760, 1761,
       1762, 1763, 1764, 1765, 1766, 1767, 1768, 1769, 1770, 1771, 1772,
       1773, 1774, 1775, 1776, 1777, 1778, 1779, 1780, 1781, 1782, 1783,
       1784, 1785, 1786, 1787, 1788, 1789, 1790], dtype=int64)

In [81]:
df_temp.isnull().sum()

Year                      0
Country                   0
Average Temperature    2547
dtype: int64

In [82]:
# drop null values
df_temp=df_temp.dropna()

In [83]:
df_temp

       Year        Country  Average Temperature
0      1849  CÃ´te d'Ivoire                25.58
1      1850  CÃ´te d'Ivoire                25.52
2      1851  CÃ´te d'Ivoire                25.67
7      1856  CÃ´te d'Ivoire                26.28
8      1857  CÃ´te d'Ivoire                25.17
...     ...            ...                  ...
71306  2009         Mexico                21.76
71307  2010         Mexico                20.90
71308  2011         Mexico                21.55
71309  2012         Mexico                21.52
71310  2013         Mexico                22.19

[68764 rows x 3 columns]

In [84]:
df_temp.describe()

               Year  Average Temperature
count  68764.000000         68764.000000
mean    1908.742423            16.183876
std       66.060692             7.592960
min     1743.000000           -14.350000
25%     1862.000000             9.750000
50%     1914.000000            16.140000
75%     1964.000000            23.762500
max     2013.000000            30.730000

In [85]:
df_temp[df_temp.duplicated()==True]

       Year                   Country  Average Temperature
2143   1978  United States of America                11.56
2625   1981                     India                25.78
3992   1743  United States of America                 5.34
3993   1744  United States of America                13.88
3994   1745  United States of America                 4.00
...     ...                       ...                  ...
71306  2009                    Mexico                21.76
71307  2010                    Mexico                20.90
71308  2011                    Mexico                21.55
71309  2012                    Mexico                21.52
71310  2013                    Mexico                22.19

[5788 rows x 3 columns]

In [86]:
# Calculating average temperature based on year and country
df_temp = df_temp.groupby(["Year", "Country"]).agg({"Average Temperature": "mean"}).reset_index()

In [87]:
df_temp

       Year                 Country  Average Temperature
0      1743                 Albania               12.690
1      1743                 Austria                4.110
2      1743                 Belarus                0.230
3      1743                 Belgium                7.520
4      1743  Bosnia And Herzegovina                4.980
...     ...                     ...                  ...
27474  2013              Uzbekistan               13.660
27475  2013               Venezuela               26.598
27476  2013                 Vietnam               25.780
27477  2013                  Zambia               20.140
27478  2013                Zimbabwe               19.760

[27479 rows x 3 columns]

In [88]:
df_temp[df_temp.duplicated()==True]

Empty DataFrame
Columns: [Year, Country, Average Temperature]
Index: []

In [89]:
df_temp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27479 entries, 0 to 27478
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Year                 27479 non-null  int64
 1   Country              27479 non-null  object
 2   Average Temperature  27479 non-null  float64
dtypes: float64(1), int64(1), object(1)
memory usage: 644.2+ KB

In [90]:
# Rounding average temperature values to two decimal points
df_temp= df_temp.round(2)

In [91]:
df_temp

       Year                 Country  Average Temperature
0      1743                 Albania                12.69
1      1743                 Austria                 4.11
2      1743                 Belarus                 0.23
3      1743                 Belgium                 7.52
4      1743  Bosnia And Herzegovina                 4.98
...     ...                     ...                  ...
27474  2013              Uzbekistan                13.66
27475  2013               Venezuela                26.60
27476  2013                 Vietnam                25.78
27477  2013                  Zambia                20.14
27478  2013                Zimbabwe                19.76

[27479 rows x 3 columns]

In [92]:
df_yield.to_csv("Resources/yield.csv",index=False)

In [93]:
df_rain.to_csv("Resources/rainfall.csv",index=False)

In [94]:
df_pes.to_csv("Resources/pesticides.csv",index=False)

In [95]:
df_temp.to_csv("Resources/temp.csv",index=False)